
## Plan Result




<pre><code>Plan: 17 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.hmc-hearing-management-db.azurerm_postgresql_server.replica[&#34;replica01&#34;]
  * module.hmc-hearing-management-db.azurerm_postgresql_virtual_network_rule.replica_rules[&#34;replica01-aks&#34;]
  * module.hmc-hearing-management-db.azurerm_postgresql_virtual_network_rule.replica_rules[&#34;replica01-aks-aat-00&#34;]
  * module.hmc-hearing-management-db.azurerm_postgresql_virtual_network_rule.replica_rules[&#34;replica01-aks-aat-01&#34;]
  * module.hmc-hearing-management-db.azurerm_postgresql_virtual_network_rule.replica_rules[&#34;replica01-ase&#34;]
  * module.hmc-hearing-management-db.azurerm_postgresql_virtual_network_rule.replica_rules[&#34;replica01-bastion-nonprod-vnet&#34;]
  * module.hmc-hearing-management-db.azurerm_postgresql_virtual_network_rule.replica_rules[&#34;replica01-cftaks-tf-aks00&#34;]
  * module.hmc-hearing-management-db.azurerm_postgresql_virtual_network_rule.replica_rules[&#34;replica01-cftaks-tf-aks01&#34;]
  * module.hmc-hearing-management-db.azurerm_postgresql_virtual_network_rule.replica_rules[&#34;replica01-idam-aat2-vnet&#34;]
  * module.hmc-hearing-management-db.azurerm_postgresql_virtual_network_rule.replica_rules[&#34;replica01-jenkins-aks&#34;]
  * module.hmc-hearing-management-db.azurerm_postgresql_virtual_network_rule.replica_rules[&#34;replica01-jenkins-aks-agent&#34;]
  * module.hmc-hearing-management-db.azurerm_postgresql_virtual_network_rule.replica_rules[&#34;replica01-shared-services-dev-aks00&#34;]
  * module.hmc-hearing-management-db.azurerm_postgresql_virtual_network_rule.replica_rules[&#34;replica01-shared-services-dev-aks01&#34;]
  * module.hmc-hearing-management-db.azurerm_postgresql_virtual_network_rule.replica_rules[&#34;replica01-shared-services-stg-aks00&#34;]
  * module.hmc-hearing-management-db.azurerm_postgresql_virtual_network_rule.replica_rules[&#34;replica01-shared-services-stg-aks01&#34;]
  * module.hmc-hearing-management-db.azurerm_postgresql_virtual_network_rule.replica_rules[&#34;replica01-shared-services-test-aks00&#34;]
  * module.hmc-hearing-management-db.azurerm_postgresql_virtual_network_rule.replica_rules[&#34;replica01-shared-services-test-aks01&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.hmc-hearing-management-db.azurerm_postgresql_server.replica["replica01"] will be created
  + resource "azurerm_postgresql_server" "replica" {
      + administrator_login              = "hmc"
      + administrator_login_password     = (sensitive value)
      + auto_grow_enabled                = (known after apply)
      + backup_retention_days            = 35
      + create_mode                      = "Replica"
      + creation_source_server_id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-cft-hearing-service-postgres-db-data-aat/providers/Microsoft.DBforPostgreSQL/servers/hmc-cft-hearing-service-postgres-db-aat"
      + fqdn                             = (known after apply)
      + geo_redundant_backup_enabled     = true
      + id                               = (known after apply)
      + location                         = "uksouth"
      + name                             = "hmc-cft-hearing-service-postgres-db-aat-replica01"
      + public_network_access_enabled    = true
      + resource_group_name              = "hmc-cft-hearing-service-postgres-db-data-aat"
      + sku_name                         = "GP_Gen5_2"
      + ssl_enforcement                  = (known after apply)
      + ssl_enforcement_enabled          = true
      + ssl_minimal_tls_version_enforced = "TLS1_2"
      + storage_mb                       = 51200
      + tags                             = {
          + "BuiltFrom"           = "https://github.com/HMCTS/hmc-cft-hearing-service.git"
          + "application"         = "core-case-data"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#ccd_support"
          + "environment"         = "staging"
          + "managedBy"           = "CDM"
        }
      + version                          = "11"

      + storage_profile {
          + auto_grow             = (known after apply)
          + backup_retention_days = (known after apply)
          + geo_redundant_backup  = (known after apply)
          + storage_mb            = (known after apply)
        }
    }

  # module.hmc-hearing-management-db.azurerm_postgresql_virtual_network_rule.replica_rules["replica01-aks"] will be created
  + resource "azurerm_postgresql_virtual_network_rule" "replica_rules" {
      + id                                   = (known after apply)
      + ignore_missing_vnet_service_endpoint = true
      + name                                 = "replica01-aks"
      + resource_group_name                  = "hmc-cft-hearing-service-postgres-db-data-aat"
      + server_name                          = "hmc-cft-hearing-service-postgres-db-aat-replica01"
      + subnet_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/aks"
    }

  # module.hmc-hearing-management-db.azurerm_postgresql_virtual_network_rule.replica_rules["replica01-aks-aat-00"] will be created
  + resource "azurerm_postgresql_virtual_network_rule" "replica_rules" {
      + id                                   = (known after apply)
      + ignore_missing_vnet_service_endpoint = true
      + name                                 = "replica01-aks-aat-00"
      + resource_group_name                  = "hmc-cft-hearing-service-postgres-db-data-aat"
      + server_name                          = "hmc-cft-hearing-service-postgres-db-aat-replica01"
      + subnet_id                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/aks-infra-aat-rg/providers/Microsoft.Network/virtualNetworks/core-aat-vnet/subnets/aks-00"
    }

  # module.hmc-hearing-management-db.azurerm_postgresql_virtual_network_rule.replica_rules["replica01-aks-aat-01"] will be created
  + resource "azurerm_postgresql_virtual_network_rule" "replica_rules" {
      + id                                   = (known after apply)
      + ignore_missing_vnet_service_endpoint = true
      + name                                 = "replica01-aks-aat-01"
      + resource_group_name                  = "hmc-cft-hearing-service-postgres-db-data-aat"
      + server_name                          = "hmc-cft-hearing-service-postgres-db-aat-replica01"
      + subnet_id                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/aks-infra-aat-rg/providers/Microsoft.Network/virtualNetworks/core-aat-vnet/subnets/aks-01"
    }

  # module.hmc-hearing-management-db.azurerm_postgresql_virtual_network_rule.replica_rules["replica01-ase"] will be created
  + resource "azurerm_postgresql_virtual_network_rule" "replica_rules" {
      + id                                   = (known after apply)
      + ignore_missing_vnet_service_endpoint = true
      + name                                 = "replica01-ase"
      + resource_group_name                  = "hmc-cft-hearing-service-postgres-db-data-aat"
      + server_name                          = "hmc-cft-hearing-service-postgres-db-aat-replica01"
      + subnet_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-3-aat"
    }

  # module.hmc-hearing-management-db.azurerm_postgresql_virtual_network_rule.replica_rules["replica01-bastion-nonprod-vnet"] will be created
  + resource "azurerm_postgresql_virtual_network_rule" "replica_rules" {
      + id                                   = (known after apply)
      + ignore_missing_vnet_service_endpoint = true
      + name                                 = "replica01-bastion-nonprod-vnet"
      + resource_group_name                  = "hmc-cft-hearing-service-postgres-db-data-aat"
      + server_name                          = "hmc-cft-hearing-service-postgres-db-aat-replica01"
      + subnet_id                            = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/resourceGroups/bastion-nonprod-rg/providers/Microsoft.Network/virtualNetworks/bastion-nonprod-vnet/subnets/bastion"
    }

  # module.hmc-hearing-management-db.azurerm_postgresql_virtual_network_rule.replica_rules["replica01-cftaks-tf-aks00"] will be created
  + resource "azurerm_postgresql_virtual_network_rule" "replica_rules" {
      + id                                   = (known after apply)
      + ignore_missing_vnet_service_endpoint = true
      + name                                 = "replica01-cftaks-tf-aks00"
      + resource_group_name                  = "hmc-cft-hearing-service-postgres-db-data-aat"
      + server_name                          = "hmc-cft-hearing-service-postgres-db-aat-replica01"
      + subnet_id                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/aks-00"
    }

  # module.hmc-hearing-management-db.azurerm_postgresql_virtual_network_rule.replica_rules["replica01-cftaks-tf-aks01"] will be created
  + resource "azurerm_postgresql_virtual_network_rule" "replica_rules" {
      + id                                   = (known after apply)
      + ignore_missing_vnet_service_endpoint = true
      + name                                 = "replica01-cftaks-tf-aks01"
      + resource_group_name                  = "hmc-cft-hearing-service-postgres-db-data-aat"
      + server_name                          = "hmc-cft-hearing-service-postgres-db-aat-replica01"
      + subnet_id                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/aks-01"
    }

  # module.hmc-hearing-management-db.azurerm_postgresql_virtual_network_rule.replica_rules["replica01-idam-aat2-vnet"] will be created
  + resource "azurerm_postgresql_virtual_network_rule" "replica_rules" {
      + id                                   = (known after apply)
      + ignore_missing_vnet_service_endpoint = true
      + name                                 = "replica01-idam-aat2-vnet"
      + resource_group_name                  = "hmc-cft-hearing-service-postgres-db-data-aat"
      + server_name                          = "hmc-cft-hearing-service-postgres-db-aat-replica01"
      + subnet_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-idam-aat2/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-aat2/subnets/core-infra-subnet-7-idam-aat2"
    }

  # module.hmc-hearing-management-db.azurerm_postgresql_virtual_network_rule.replica_rules["replica01-jenkins-aks"] will be created
  + resource "azurerm_postgresql_virtual_network_rule" "replica_rules" {
      + id                                   = (known after apply)
      + ignore_missing_vnet_service_endpoint = true
      + name                                 = "replica01-jenkins-aks"
      + resource_group_name                  = "hmc-cft-hearing-service-postgres-db-data-aat"
      + server_name                          = "hmc-cft-hearing-service-postgres-db-aat-replica01"
      + subnet_id                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/iaas"
    }

  # module.hmc-hearing-management-db.azurerm_postgresql_virtual_network_rule.replica_rules["replica01-jenkins-aks-agent"] will be created
  + resource "azurerm_postgresql_virtual_network_rule" "replica_rules" {
      + id                                   = (known after apply)
      + ignore_missing_vnet_service_endpoint = true
      + name                                 = "replica01-jenkins-aks-agent"
      + resource_group_name                  = "hmc-cft-hearing-service-postgres-db-data-aat"
      + server_name                          = "hmc-cft-hearing-service-postgres-db-aat-replica01"
      + subnet_id                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/aks-00"
    }

  # module.hmc-hearing-management-db.azurerm_postgresql_virtual_network_rule.replica_rules["replica01-shared-services-dev-aks00"] will be created
  + resource "azurerm_postgresql_virtual_network_rule" "replica_rules" {
      + id                                   = (known after apply)
      + ignore_missing_vnet_service_endpoint = true
      + name                                 = "replica01-shared-services-dev-aks00"
      + resource_group_name                  = "hmc-cft-hearing-service-postgres-db-data-aat"
      + server_name                          = "hmc-cft-hearing-service-postgres-db-aat-replica01"
      + subnet_id                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/virtualNetworks/ss-dev-vnet/subnets/aks-00"
    }

  # module.hmc-hearing-management-db.azurerm_postgresql_virtual_network_rule.replica_rules["replica01-shared-services-dev-aks01"] will be created
  + resource "azurerm_postgresql_virtual_network_rule" "replica_rules" {
      + id                                   = (known after apply)
      + ignore_missing_vnet_service_endpoint = true
      + name                                 = "replica01-shared-services-dev-aks01"
      + resource_group_name                  = "hmc-cft-hearing-service-postgres-db-data-aat"
      + server_name                          = "hmc-cft-hearing-service-postgres-db-aat-replica01"
      + subnet_id                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/virtualNetworks/ss-dev-vnet/subnets/aks-01"
    }

  # module.hmc-hearing-management-db.azurerm_postgresql_virtual_network_rule.replica_rules["replica01-shared-services-stg-aks00"] will be created
  + resource "azurerm_postgresql_virtual_network_rule" "replica_rules" {
      + id                                   = (known after apply)
      + ignore_missing_vnet_service_endpoint = true
      + name                                 = "replica01-shared-services-stg-aks00"
      + resource_group_name                  = "hmc-cft-hearing-service-postgres-db-data-aat"
      + server_name                          = "hmc-cft-hearing-service-postgres-db-aat-replica01"
      + subnet_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/aks-00"
    }

  # module.hmc-hearing-management-db.azurerm_postgresql_virtual_network_rule.replica_rules["replica01-shared-services-stg-aks01"] will be created
  + resource "azurerm_postgresql_virtual_network_rule" "replica_rules" {
      + id                                   = (known after apply)
      + ignore_missing_vnet_service_endpoint = true
      + name                                 = "replica01-shared-services-stg-aks01"
      + resource_group_name                  = "hmc-cft-hearing-service-postgres-db-data-aat"
      + server_name                          = "hmc-cft-hearing-service-postgres-db-aat-replica01"
      + subnet_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/aks-01"
    }

  # module.hmc-hearing-management-db.azurerm_postgresql_virtual_network_rule.replica_rules["replica01-shared-services-test-aks00"] will be created
  + resource "azurerm_postgresql_virtual_network_rule" "replica_rules" {
      + id                                   = (known after apply)
      + ignore_missing_vnet_service_endpoint = true
      + name                                 = "replica01-shared-services-test-aks00"
      + resource_group_name                  = "hmc-cft-hearing-service-postgres-db-data-aat"
      + server_name                          = "hmc-cft-hearing-service-postgres-db-aat-replica01"
      + subnet_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/virtualNetworks/ss-test-vnet/subnets/aks-00"
    }

  # module.hmc-hearing-management-db.azurerm_postgresql_virtual_network_rule.replica_rules["replica01-shared-services-test-aks01"] will be created
  + resource "azurerm_postgresql_virtual_network_rule" "replica_rules" {
      + id                                   = (known after apply)
      + ignore_missing_vnet_service_endpoint = true
      + name                                 = "replica01-shared-services-test-aks01"
      + resource_group_name                  = "hmc-cft-hearing-service-postgres-db-data-aat"
      + server_name                          = "hmc-cft-hearing-service-postgres-db-aat-replica01"
      + subnet_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/virtualNetworks/ss-test-vnet/subnets/aks-01"
    }

Plan: 17 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":302,"Program":"tfcmt","SHA1":"","Vars":{}} -->